# Задача

'''
print("Давайте составим треугольник, укажите длину каждой cтороны:")
a = int(input("a = "))
b = int(input("b = "))
c = int(input("c = "))

if a + b > c and a + c > b and b + c > a:
    print("Треугольник существует")
else:
    print("Треугольник не существует")

'''
'''
Напишите код, который запрашивает число и сообщает является ли оно \n 
простым или составным. Используйте правило для проверки: \n 
“Число является простым, если делится нацело только на единицу и на себя”. \n
Сделайте ограничение на ввод отрицательных чисел и чисел больше 100 тысяч.
'''

num_01 = int(input("Введите число от 1 до 1000:  "))
if num_01 > 1 and num_01 < 1000:
    num_02 = num_01

if num_02 % 2 == 0:
    print("Число простое")
else:
    print("Число составное")


